#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jb-smoker/ace-automation-dcf/runs/run-fVPyX98KF8X5oJGG

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aviatrix_distributed_firewalling_policy_list.default will be created
  + resource "aviatrix_distributed_firewalling_policy_list" "default" {
      + id = (known after apply)

      + policies {
          + action                   = "PERMIT"
          + decrypt_policy           = "DECRYPT_UNSPECIFIED"
          + dst_smart_groups         = [
              + "def000ad-0000-0000-0000-000000000001",
            ]
          + exclude_sg_orchestration = false
          + flow_app_requirement     = "APP_UNSPECIFIED"
          + logging                  = true
          + name                     = "allow-internet"
          + priority                 = 1001
          + protocol                 = "TCP"
          + src_smart_groups         = (known after apply)
          + uuid                     = (known after apply)
          + watch                    = false
          + web_groups               = (known after apply)

          + port_ranges {
              + lo = 443
            }
        }
      + policies {
          + action                   = "DENY"
          + decrypt_policy           = "DECRYPT_UNSPECIFIED"
          + dst_smart_groups         = [
              + "def000ad-0000-0000-0000-000000000000",
            ]
          + exclude_sg_orchestration = true
          + flow_app_requirement     = "APP_UNSPECIFIED"
          + logging                  = true
          + name                     = "default-deny-all"
          + priority                 = 2147483646
          + protocol                 = "Any"
          + src_smart_groups         = [
              + "def000ad-0000-0000-0000-000000000000",
            ]
          + uuid                     = (known after apply)
          + watch                    = false
        }
    }

  # aviatrix_smart_group.rfc1918 will be created
  + resource "aviatrix_smart_group" "rfc1918" {
      + id   = (known after apply)
      + name = "rfc1918"
      + uuid = (known after apply)

      + selector {
          + match_expressions {
              + cidr = "10.0.0.0/8"
            }
          + match_expressions {
              + cidr = "172.16.0.0/12"
            }
          + match_expressions {
              + cidr = "192.168.0.0/16"
            }
        }
    }

  # aviatrix_web_group.allow_internet_https will be created
  + resource "aviatrix_web_group" "allow_internet_https" {
      + id   = (known after apply)
      + name = "allow-internet-https"
      + uuid = (known after apply)

      + selector {
          + match_expressions {
              + snifilter = "*.amazonaws.com"
            }
          + match_expressions {
              + snifilter = "*.microsoft.com"
            }
          + match_expressions {
              + snifilter = "aviatrix.com"
            }
          + match_expressions {
              + snifilter = "cloud.google.com"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 3 estimated
           $0.0/mo +$0.0

</details>
Pusher: @jb-smoker, Action: `pull_request